In [1]:
import numpy as np

In [4]:
import pandas as pd
df=pd.DataFrame([[0,1,2,3],
                       [4,5,6,7]])

In [12]:
df

    0  1  2  3
0   0  1  2  3
1  44  5  6  7

In [6]:
y= df.loc[:,0]

In [13]:
y

0     0
1    44
Name: 0, dtype: int64

In [10]:
y.iloc[1] = 44

In [11]:
y.iloc[1]

44

In [14]:
df.drop([0], axis = 1, inplace=True)

In [15]:
df

   1  2  3
0  1  2  3
1  5  6  7

In [16]:
y

0     0
1    44
Name: 0, dtype: int64